probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FMC</name>
      <description>FMC</description>
      <groupName>FMC</groupName>
      <baseAddress>0x52004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FMC</name>
        <description>FMC global interrupt</description>
        <value>48</value>
      </interrupt>
      <registers>
        <cluster><dim>2</dim><dimIncrement>0x4</dimIncrement><dimIndex>1,2</dimIndex><name>SDBANK%s</name><description>Cluster SDBANK%s, containing SDTR?, SDCR?</description><addressOffset>0x140</addressOffset><register>
          <name>SDTR</name>
          <displayName>SDTR1</displayName>
          <description>This register contains the timing parameters
          of each SDRAM bank</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>TMRD</name>
              <description>Load Mode Register to Active These bits
              define the delay between a Load Mode Register command
              and an Active or Refresh command in number of memory
              clock cycles. ....</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TXSR</name>
              <description>Exit Self-refresh delay These bits
              define the delay from releasing the Self-refresh
              command to issuing the Activate command in number of
              memory clock cycles. .... Note: If two SDRAM devices
              are used, the FMC_SDTR1 and FMC_SDTR2 must be
              programmed with the same TXSR timing corresponding to
              the slowest SDRAM device.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRAS</name>
              <description>Self refresh time These bits define the
              minimum Self-refresh period in number of memory clock
              cycles. ....</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>Row cycle delay These bits define the
              delay between the Refresh command and the Activate
              command, as well as the delay between two consecutive
              Refresh commands. It is expressed in number of memory
              clock cycles. The TRC timing is only configured in
              the FMC_SDTR1 register. If two SDRAM devices are
              used, the TRC must be programmed with the timings of
              the slowest device. .... Note: TRC must match the TRC
              and TRFC (Auto Refresh period) timings defined in the
              SDRAM device datasheet. Note: The corresponding bits
              in the FMC_SDTR2 register are dont
              care.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TWR</name>
              <description>Recovery delay These bits define the
              delay between a Write and a Precharge command in
              number of memory clock cycles. .... Note: TWR must be
              programmed to match the write recovery time (tWR)
              defined in the SDRAM datasheet, and to guarantee
              that: TWR &amp;#8805; TRAS - TRCD and TWR
              &amp;#8805;TRC - TRCD - TRP Example: TRAS= 4 cycles,
              TRCD= 2 cycles. So, TWR &amp;gt;= 2 cycles. TWR must
              be programmed to 0x1. If two SDRAM devices are used,
              the FMC_SDTR1 and FMC_SDTR2 must be programmed with
              the same TWR timing corresponding to the slowest
              SDRAM device.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRP</name>
              <description>Row precharge delay These bits define
              the delay between a Precharge command and another
              command in number of memory clock cycles. The TRP
              timing is only configured in the FMC_SDTR1 register.
              If two SDRAM devices are used, the TRP must be
              programmed with the timing of the slowest device.
              .... Note: The corresponding bits in the FMC_SDTR2
              register are dont care.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRCD</name>
              <description>Row to column delay These bits define
              the delay between the Activate command and a
              Read/Write command in number of memory clock cycles.
              ....</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDCR</name>
          <displayName>SDCR1</displayName>
          <description>This register contains the control
          parameters for each SDRAM memory bank</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000002D0</resetValue>
          <fields>
            <field>
              <name>NC</name>
              <description>Number of column address bits These bits
              define the number of bits of a column
              address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NR</name>
              <description>Number of row address bits These bits
              define the number of bits of a row
              address.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>Memory data bus width. These bits define
              the memory device width.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <description>Number of internal banks This bit sets
              the number of internal banks.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS Latency This bits sets the SDRAM CAS
              latency in number of memory clock
              cycles</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WP</name>
              <description>Write protection This bit enables write
              mode access to the SDRAM bank.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDCLK</name>
              <description>SDRAM clock configuration These bits
              define the SDRAM clock period for both SDRAM banks
              and allow disabling the clock before changing the
              frequency. In this case the SDRAM must be
              re-initialized. Note: The corresponding bits in the
              FMC_SDCR2 register is read only.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RBURST</name>
              <description>Burst read This bit enables burst read
              mode. The SDRAM controller anticipates the next read
              commands during the CAS latency and stores data in
              the Read FIFO. Note: The corresponding bit in the
              FMC_SDCR2 register is read only.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPIPE</name>
              <description>Read pipe These bits define the delay,
              in KCK_FMC clock cycles, for reading data after CAS
              latency. Note: The corresponding bits in the
              FMC_SDCR2 register is read only.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
