probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        <register>
          <name>OSPEEDR</name>
          <displayName>OSPEEDR</displayName>
          <description>GPIO port output speed
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0C000000</resetValue>
          <fields>
            <field>
              <name>OSPEEDR0</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>OSPEEDR0</name><usage>read-write</usage><enumeratedValue><name>LowSpeed</name><description>Low speed</description><value>0</value></enumeratedValue><enumeratedValue><name>MediumSpeed</name><description>Medium speed</description><value>1</value></enumeratedValue><enumeratedValue><name>HighSpeed</name><description>High speed</description><value>2</value></enumeratedValue><enumeratedValue><name>VeryHighSpeed</name><description>Very high speed</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OSPEEDR1</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR2</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR3</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR4</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR5</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR6</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR7</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR8</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR9</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR10</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR11</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR12</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR13</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR14</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR15</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="OSPEEDR0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <displayName>PUPDR</displayName>
          <description>GPIO port pull-up/pull-down
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x12100000</resetValue>
          <fields>
            <field>
              <name>PUPDR0</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PUPDR0</name><usage>read-write</usage><enumeratedValue><name>Floating</name><description>No pull-up, pull-down</description><value>0</value></enumeratedValue><enumeratedValue><name>PullUp</name><description>Pull-up</description><value>1</value></enumeratedValue><enumeratedValue><name>PullDown</name><description>Pull-down</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PUPDR1</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR2</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR3</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR4</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR5</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR6</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR7</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR8</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR9</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR10</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR11</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR12</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR13</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR14</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
            <field>
              <name>PUPDR15</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>GPIO port input data register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDR0</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>IDR0</name><usage>read-write</usage><enumeratedValue><name>High</name><description>Input is logic high</description><value>1</value></enumeratedValue><enumeratedValue><name>Low</name><description>Input is logic low</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IDR1</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR2</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR3</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR4</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR5</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR6</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR7</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR8</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR9</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR10</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR11</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR12</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR13</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR14</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
            <field>
              <name>IDR15</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="IDR0"/>
            </field>
          </fields>
        </register>
