probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        <register>
          <name>BRUR</name>
          <displayName>C0BRUR</displayName>
          <description>MDMA channel x Block Repeat address Update
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUV</name>
              <description>source adresse update
              value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DUV</name>
              <description>destination address update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LAR</name>
          <displayName>C0LAR</displayName>
          <description>MDMA channel x Link Address
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LAR</name>
              <description>Link address register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBR</name>
          <displayName>C0TBR</displayName>
          <description>MDMA channel x Trigger and Bus selection
          Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSEL</name>
              <description>Trigger selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SBUS</name>
              <description>Source BUS select This bit is protected
              and can be written only if EN is 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBUS</name>
              <description>Destination BUS slect This bit is
              protected and can be written only if EN is
              0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAR</name>
          <displayName>C0MAR</displayName>
          <description>MDMA channel x Mask address
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAR</name>
              <description>Mask address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDR</name>
          <displayName>C0MDR</displayName>
          <description>MDMA channel x Mask Data
          register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDR</name>
              <description>Mask data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        </cluster><register>
          <name>GISR0</name>
          <displayName>GISR0</displayName>
          <description>MDMA Global Interrupt/Status
          Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIF0</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF1</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF2</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF3</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF4</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF5</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF6</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF7</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF8</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF9</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF10</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF11</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF12</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF13</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF14</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF15</name>
              <description>Channel x global interrupt flag (x=...)
              This bit is set and reset by hardware. It is a
              logical OR of all the Channel x interrupt flags
              (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in
              the interrupt mask register (CTCIEx, BTIEx, BRTIEx,
              TEIEx)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
