probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        <register>
          <name>CFG2</name>
          <displayName>CFG2</displayName>
          <description>configuration register 2</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFCNTR</name>
              <description>Alternate function GPIOs
              control</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AFCNTR</name><usage>read-write</usage><enumeratedValue><name>NotControlled</name><description>Peripheral takes no control of GPIOs while disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Controlled</name><description>Peripheral controls GPIOs while disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SSOM</name>
              <description>SS output management in master
              mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SSOM</name><usage>read-write</usage><enumeratedValue><name>Asserted</name><description>SS is asserted until data transfer complete</description><value>0</value></enumeratedValue><enumeratedValue><name>NotAsserted</name><description>Data frames interleaved with SS not asserted during MIDI</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SSOE</name>
              <description>SS output enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SSOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SS output is disabled in master mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SS output is enabled in master mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SSIOP</name>
              <description>SS input/output polarity</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SSIOP</name><usage>read-write</usage><enumeratedValue><name>ActiveLow</name><description>Low level is active for SS signal</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveHigh</name><description>High level is active for SS signal</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SSM</name>
              <description>Software management of SS signal
              input</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SSM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Software slave management disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Software slave management enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock polarity</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CPOL</name><usage>read-write</usage><enumeratedValue><name>IdleLow</name><description>CK to 0 when idle</description><value>0</value></enumeratedValue><enumeratedValue><name>IdleHigh</name><description>CK to 1 when idle</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Clock phase</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CPHA</name><usage>read-write</usage><enumeratedValue><name>FirstEdge</name><description>The first clock transition is the first data capture edge</description><value>0</value></enumeratedValue><enumeratedValue><name>SecondEdge</name><description>The second clock transition is the first data capture edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSBFRST</name>
              <description>Data frame format</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSBFRST</name><usage>read-write</usage><enumeratedValue><name>MSBFirst</name><description>Data is transmitted/received with the MSB first</description><value>0</value></enumeratedValue><enumeratedValue><name>LSBFirst</name><description>Data is transmitted/received with the LSB first</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MASTER</name>
              <description>SPI Master</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MASTER</name><usage>read-write</usage><enumeratedValue><name>Slave</name><description>Slave configuration</description><value>0</value></enumeratedValue><enumeratedValue><name>Master</name><description>Master configuration</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SP</name>
              <description>Serial Protocol</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>SP</name><usage>read-write</usage><enumeratedValue><name>Motorola</name><description>Motorola SPI protocol</description><value>0</value></enumeratedValue><enumeratedValue><name>TI</name><description>TI SPI protocol</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COMM</name>
              <description>SPI Communication Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>COMM</name><usage>read-write</usage><enumeratedValue><name>FullDuplex</name><description>Full duplex</description><value>0</value></enumeratedValue><enumeratedValue><name>Transmitter</name><description>Simplex transmitter only</description><value>1</value></enumeratedValue><enumeratedValue><name>Receiver</name><description>Simplex receiver only</description><value>2</value></enumeratedValue><enumeratedValue><name>HalfDuplex</name><description>Half duplex</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IOSWP</name>
              <description>Swap functionality of MISO and MOSI
              pins</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>IOSWP</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MISO and MOSI not swapped</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MISO and MOSI swapped</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MIDI</name>
              <description>Master Inter-Data Idleness</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MSSI</name>
              <description>Master SS Idleness</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSERFIE</name>
              <description>Additional number of transactions reload
              interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TSERFIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>TSER loaded interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>TSER loaded interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MODFIE</name>
              <description>Mode Fault interrupt
              enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>MODFIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Mode fault interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>Mode fault interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TIFREIE</name>
              <description>TIFRE interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TIFREIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>TI frame format error interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>TI frame format error interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CRCEIE</name>
              <description>CRC Interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>CRCEIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>CRC error interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>CRC error interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVRIE</name>
              <description>OVR interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>OVRIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Overrun interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>Overrun interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UDRIE</name>
              <description>UDR interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>UDRIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Underrun interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>Underrun interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXTFIE</name>
              <description>TXTFIE interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TXTFIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Transmission transfer filled interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>Transmission transfer filled interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOTIE</name>
              <description>EOT, SUSP and TXC interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>EOTIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>End-of-transfer interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>End-of-transfer interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DXPIE</name>
              <description>DXP interrupt enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>DXPIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Duplex transfer complete interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>Duplex transfer complete interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXPIE</name>
              <description>TXP interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TXPIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>TX space available interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>TX space available interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXPIE</name>
              <description>RXP Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>RXPIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>RX data available interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>RX data available interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
