probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        </cluster><register>
          <name>SSCR</name>
          <displayName>SSCR</displayName>
          <description>Synchronization Size Configuration
          Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HSW</name>
              <description>Horizontal Synchronization Width (in
              units of pixel clock period)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
            <field>
              <name>VSH</name>
              <description>Vertical Synchronization Height (in
              units of horizontal scan line)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BPCR</name>
          <displayName>BPCR</displayName>
          <description>Back Porch Configuration
          Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AHBP</name>
              <description>Accumulated Horizontal back porch (in
              units of pixel clock period)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
            <field>
              <name>AVBP</name>
              <description>Accumulated Vertical back porch (in
              units of horizontal scan line)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AWCR</name>
          <displayName>AWCR</displayName>
          <description>Active Width Configuration
          Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AAW</name>
              <description>Accumulated Active Width (in units of pixel clock period)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
            <field>
              <name>AAH</name>
              <description>Accumulated Active Height (in units of
              horizontal scan line)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TWCR</name>
          <displayName>TWCR</displayName>
          <description>Total Width Configuration
          Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TOTALW</name>
              <description>Total Width (in units of pixel clock
              period)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
            <field>
              <name>TOTALH</name>
              <description>Total Height (in units of horizontal
              scan line)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GCR</name>
          <displayName>GCR</displayName>
          <description>Global Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00002220</resetValue>
          <fields>
            <field>
              <name>HSPOL</name>
              <description>Horizontal Synchronization
              Polarity</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>HSPOL</name><usage>read-write</usage><enumeratedValue><name>ActiveLow</name><description>Horizontal synchronization polarity is active low</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveHigh</name><description>Horizontal synchronization polarity is active high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>VSPOL</name>
              <description>Vertical Synchronization
              Polarity</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>VSPOL</name><usage>read-write</usage><enumeratedValue><name>ActiveLow</name><description>Vertical synchronization polarity is active low</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveHigh</name><description>Vertical synchronization polarity is active high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DEPOL</name>
              <description>Data Enable Polarity</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>DEPOL</name><usage>read-write</usage><enumeratedValue><name>ActiveLow</name><description>Data enable polarity is active low</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveHigh</name><description>Data enable polarity is active high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PCPOL</name>
              <description>Pixel Clock Polarity</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>PCPOL</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>Pixel clock on rising edge</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Pixel clock on falling edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DEN</name>
              <description>Dither Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>DEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Dither disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Dither enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DRW</name>
              <description>Dither Red Width</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DGW</name>
              <description>Dither Green Width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBW</name>
              <description>Dither Blue Width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LTDCEN</name>
              <description>LCD-TFT controller enable
              bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>LTDCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>LCD-TFT controller disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>LCD-TFT controller enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR</name>
          <displayName>SRCR</displayName>
          <description>Shadow Reload Configuration
          Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VBR</name>
              <description>Vertical Blanking Reload</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>VBR</name><usage>read-write</usage><enumeratedValue><name>Reload</name><description>The shadow registers are reloaded during the vertical blanking period (at the beginning of the first line after the active display area).</description><value>1</value></enumeratedValue><enumeratedValue><name>NoEffect</name><description>This bit is set by software and cleared only by hardware after reload (it cannot be cleared through register write once it is set)</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IMR</name>
              <description>Immediate Reload</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>IMR</name><usage>read-write</usage><enumeratedValue><name>Reload</name><description>The shadow registers are reloaded immediately. This bit is set by software and cleared only by hardware after reload</description><value>1</value></enumeratedValue><enumeratedValue><name>NoEffect</name><description>This bit is set by software and cleared only by hardware after reload (it cannot be cleared through register write once it is set)</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BCCR</name>
          <displayName>BCCR</displayName>
          <description>Background Color Configuration
          Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCBLUE</name>
              <description>Background Color Blue
              value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>BCGREEN</name>
              <description>Background Color Green
              value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>BCRED</name>
              <description>Background Color Red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RRIE</name>
              <description>Register Reload interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Register reload interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Register reload interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TERRIE</name>
              <description>Transfer Error Interrupt
              Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TERRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Transfer error interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Transfer error interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FUIE</name>
              <description>FIFO Underrun Interrupt
              Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FUIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>FIFO underrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>FIFO underrun interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LIE</name>
              <description>Line Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Line interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Line interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>Interrupt Status Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RRIF</name>
              <description>Register Reload Interrupt
              Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RRIF</name><usage>read-write</usage><enumeratedValue><name>NoReload</name><description>No register reload</description><value>0</value></enumeratedValue><enumeratedValue><name>Reload</name><description>Register reload interrupt generated when a vertical blanking reload occurs (and the first line after the active area is reached)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TERRIF</name>
              <description>Transfer Error interrupt
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TERRIF</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No transfer error</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Transfer error interrupt generated when a bus error occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FUIF</name>
              <description>FIFO Underrun Interrupt
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FUIF</name><usage>read-write</usage><enumeratedValue><name>NoUnderrun</name><description>No FIFO underrun</description><value>0</value></enumeratedValue><enumeratedValue><name>Underrun</name><description>FIFO underrun interrupt generated, if one of the layer FIFOs is empty and pixel data is read from the FIFO</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LIF</name>
              <description>Line Interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LIF</name><usage>read-write</usage><enumeratedValue><name>NotReached</name><description>Programmed line not reached</description><value>0</value></enumeratedValue><enumeratedValue><name>Reached</name><description>Line interrupt generated when a programmed line is reached</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRRIF</name>
              <description>Clears Register Reload Interrupt
              Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CRRIF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the RRIF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CTERRIF</name>
              <description>Clears the Transfer Error Interrupt
              Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CTERRIF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the TERRIF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CFUIF</name>
              <description>Clears the FIFO Underrun Interrupt
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CFUIF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the FUIF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CLIF</name>
              <description>Clears the Line Interrupt
              Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CLIF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the LIF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LIPCR</name>
          <displayName>LIPCR</displayName>
          <description>Line Interrupt Position Configuration
          Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LIPOS</name>
              <description>Line Interrupt Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSR</name>
          <displayName>CPSR</displayName>
          <description>Current Position Status
          Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CXPOS</name>
              <description>Current X Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>CYPOS</name>
              <description>Current Y Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
