probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC3</name>
      <description>Analog to Digital Converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x58026000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xD1</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC3</name>
        <description>ADC3 global interrupt</description>
        <value>127</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>ADC interrupt and status
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JQOVF</name>
              <description>ADC group injected contexts queue
              overflow flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JQOVFR</name><usage>read</usage><enumeratedValue><name>NoOverflow</name><description>No injected context queue overflow has occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Overflow</name><description>Injected context queue overflow has occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>JQOVFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear injected context queue overflow flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AWD3</name>
              <description>ADC analog watchdog 3 flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1R"/>
            <enumeratedValues derivedFrom="AWD1W"/>
            </field>
            <field>
              <name>AWD2</name>
              <description>ADC analog watchdog 2 flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1R"/>
            <enumeratedValues derivedFrom="AWD1W"/>
            </field>
            <field>
              <name>AWD1</name>
              <description>ADC analog watchdog 1 flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AWD1R</name><usage>read</usage><enumeratedValue><name>NoEvent</name><description>No analog watchdog event occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>Analog watchdog event occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>AWD1W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear analog watchdog event occurred flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JEOS</name>
              <description>ADC group injected end of sequence
              conversions flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JEOSR</name><usage>read</usage><enumeratedValue><name>NotComplete</name><description>Injected sequence is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Injected sequence complete</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>JEOSW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear Injected sequence complete flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JEOC</name>
              <description>ADC group injected end of unitary
              conversion flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JEOCR</name><usage>read</usage><enumeratedValue><name>NotComplete</name><description>Injected conversion is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Injected conversion complete</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>JEOCW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear injected conversion complete flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVR</name>
              <description>ADC group regular overrun
              flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVRR</name><usage>read</usage><enumeratedValue><name>NoOverrun</name><description>No overrun occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>OVRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear overrun occurred flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOS</name>
              <description>ADC group regular end of sequence
              conversions flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOSR</name><usage>read</usage><enumeratedValue><name>NotComplete</name><description>Regular sequence is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Regular sequence complete</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EOSW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear regular sequence complete flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOC</name>
              <description>ADC group regular end of unitary
              conversion flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOCR</name><usage>read</usage><enumeratedValue><name>NotComplete</name><description>Regular conversion is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Regular conversion complete</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EOCW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear regular conversion complete flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOSMP</name>
              <description>ADC group regular end of sampling
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOSMPR</name><usage>read</usage><enumeratedValue><name>NotEnded</name><description>End of sampling phase no yet reached</description><value>0</value></enumeratedValue><enumeratedValue><name>Ended</name><description>End of sampling phase reached</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EOSMPW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear end of sampling phase reached flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADRDY</name>
              <description>ADC ready flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADRDYR</name><usage>read</usage><enumeratedValue><name>NotReady</name><description>ADC is not ready to start conversion</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>ADC is ready to start conversion</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADRDYW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear ADC is ready to start conversion flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>ADC interrupt enable register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JQOVFIE</name>
              <description>ADC group injected contexts queue
              overflow interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JQOVFIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Injected context queue overflow interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Injected context queue overflow interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AWD3IE</name>
              <description>ADC analog watchdog 3
              interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1IE"/>
            </field>
            <field>
              <name>AWD2IE</name>
              <description>ADC analog watchdog 2
              interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1IE"/>
            </field>
            <field>
              <name>AWD1IE</name>
              <description>ADC analog watchdog 1
              interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AWD1IE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Analog watchdog interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Analog watchdog interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JEOSIE</name>
              <description>ADC group injected end of sequence
              conversions interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JEOSIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>End of injected sequence interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>End of injected sequence interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JEOCIE</name>
              <description>ADC group injected end of unitary
              conversion interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JEOCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>End of injected conversion interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>End of injected conversion interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVRIE</name>
              <description>ADC group regular overrun
              interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Overrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Overrun interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOSIE</name>
              <description>ADC group regular end of sequence
              conversions interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOSIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>End of regular sequence interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>End of regular sequence interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOCIE</name>
              <description>ADC group regular end of unitary
              conversion interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>End of regular conversion interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>End of regular conversion interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOSMPIE</name>
              <description>ADC group regular end of sampling
              interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOSMPIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>End of regular conversion sampling phase interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>End of regular conversion sampling phase interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADRDYIE</name>
              <description>ADC ready interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ADC ready interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ADC ready interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
