probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>ADC control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADCAL</name>
              <description>ADC calibration</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADCAL</name><usage>read-write</usage><enumeratedValue><name>Complete</name><description>Calibration complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Calibration</name><description>Start the calibration of the ADC</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADCALDIF</name>
              <description>ADC differential mode for
              calibration</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADCALDIF</name><usage>read-write</usage><enumeratedValue><name>SingleEnded</name><description>Calibration for single-ended mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Differential</name><description>Calibration for differential mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DEEPPWD</name>
              <description>ADC deep power down enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DEEPPWD</name><usage>read-write</usage><enumeratedValue><name>PowerUp</name><description>ADC not in deep power down</description><value>0</value></enumeratedValue><enumeratedValue><name>PowerDown</name><description>ADC in deep power down</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADVREGEN</name>
              <description>ADC voltage regulator
              enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADVREGEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ADC voltage regulator disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ADC voltage regulator enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LINCALRDYW6</name>
              <description>Linearity calibration ready Word
              6</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LINCALRDYW1"/>
            </field>
            <field>
              <name>LINCALRDYW5</name>
              <description>Linearity calibration ready Word
              5</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LINCALRDYW1"/>
            </field>
            <field>
              <name>LINCALRDYW4</name>
              <description>Linearity calibration ready Word
              4</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LINCALRDYW1"/>
            </field>
            <field>
              <name>LINCALRDYW3</name>
              <description>Linearity calibration ready Word
              3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LINCALRDYW1"/>
            </field>
            <field>
              <name>LINCALRDYW2</name>
              <description>Linearity calibration ready Word
              2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LINCALRDYW1"/>
            </field>
            <field>
              <name>LINCALRDYW1</name>
              <description>Linearity calibration ready Word
              1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LINCALRDYW1</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>LINCALFACT Word Read</description><value>0</value></enumeratedValue><enumeratedValue><name>Set</name><description>LINCALFACT Word Write</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADCALLIN</name>
              <description>Linearity calibration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADCALLIN</name><usage>read-write</usage><enumeratedValue><name>NoLinearity</name><description>ADC calibration without linearaity calibration</description><value>0</value></enumeratedValue><enumeratedValue><name>Linearity</name><description>ADC calibration with linearaity calibration</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BOOST</name>
              <description>Boost mode control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>BOOST</name><usage>read-write</usage><enumeratedValue><name>LT6_25</name><description>Boost mode used when ADC clock &#8804; 6.25 MHz</description><value>0</value></enumeratedValue><enumeratedValue><name>LT12_5</name><description>Boost mode used when 6.25 MHz &lt; ADC clock &#8804; 12.5 MHz</description><value>1</value></enumeratedValue><enumeratedValue><name>LT25</name><description>Boost mode used when 12.5 MHz &lt; ADC clock &#8804; 25.0 MHz</description><value>2</value></enumeratedValue><enumeratedValue><name>LT50</name><description>Boost mode used when 25.0 MHz &lt; ADC clock &#8804; 50.0 MHz</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JADSTP</name>
              <description>ADC group injected conversion
              stop</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ADSTPR"/>
            <enumeratedValues derivedFrom="ADSTPW"/>
            </field>
            <field>
              <name>ADSTP</name>
              <description>ADC group regular conversion
              stop</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADSTPR</name><usage>read</usage><enumeratedValue><name>NotStopping</name><description>No stop command active</description><value>0</value></enumeratedValue><enumeratedValue><name>Stopping</name><description>ADC stopping conversion</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADSTPW</name><usage>write</usage><enumeratedValue><name>StopConversion</name><description>Stop the active conversion</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JADSTART</name>
              <description>ADC group injected conversion
              start</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ADSTARTR"/>
            <enumeratedValues derivedFrom="ADSTARTW"/>
            </field>
            <field>
              <name>ADSTART</name>
              <description>ADC group regular conversion
              start</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADSTARTR</name><usage>read</usage><enumeratedValue><name>NotActive</name><description>No conversion ongoing</description><value>0</value></enumeratedValue><enumeratedValue><name>Active</name><description>ADC operating and may be converting</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADSTARTW</name><usage>write</usage><enumeratedValue><name>StartConversion</name><description>Start the ADC conversion (may be delayed for hardware triggers)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADDIS</name>
              <description>ADC disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADDISR</name><usage>read</usage><enumeratedValue><name>NotDisabling</name><description>No disable command active</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabling</name><description>ADC disabling</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADDISW</name><usage>write</usage><enumeratedValue><name>Disable</name><description>Disable the ADC</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADEN</name>
              <description>ADC enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADENR</name><usage>read</usage><enumeratedValue><name>Disabled</name><description>ADC disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ADC enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADENW</name><usage>write</usage><enumeratedValue><name>Enabled</name><description>Enable the ADC</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>ADC configuration register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JQDIS</name>
              <description>ADC group injected contexts queue
              disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JQDIS</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Injected Queue enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Injected Queue disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AWD1CH</name>
              <description>ADC analog watchdog 1 monitored channel
              selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JAUTO</name>
              <description>ADC group injected automatic trigger
              mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JAUTO</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Automatic injected group conversion disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Automatic injected group conversion enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JAWD1EN</name>
              <description>ADC analog watchdog 1 enable on scope
              ADC group injected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JAWD1EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Analog watchdog 1 disabled on injected channels</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Analog watchdog 1 enabled on injected channels</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AWD1EN</name>
              <description>ADC analog watchdog 1 enable on scope
              ADC group regular</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AWD1EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Analog watchdog 1 disabled on regular channels</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Analog watchdog 1 enabled on regular channels</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AWD1SGL</name>
              <description>ADC analog watchdog 1 monitoring a
              single channel or all channels</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AWD1SGL</name><usage>read-write</usage><enumeratedValue><name>All</name><description>Analog watchdog 1 enabled on all channels</description><value>0</value></enumeratedValue><enumeratedValue><name>Single</name><description>Analog watchdog 1 enabled on single channel selected in AWD1CH</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JQM</name>
              <description>ADC group injected contexts queue
              mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JQM</name><usage>read-write</usage><enumeratedValue><name>Mode0</name><description>JSQR Mode 0: Queue maintains the last written configuration into JSQR</description><value>0</value></enumeratedValue><enumeratedValue><name>Mode1</name><description>JSQR Mode 1: An empty queue disables software and hardware triggers of the injected sequence</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JDISCEN</name>
              <description>ADC group injected sequencer
              discontinuous mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JDISCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Discontinuous mode on injected channels disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Discontinuous mode on injected channels enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DISCNUM</name>
              <description>ADC group regular sequencer
              discontinuous number of ranks</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DISCEN</name>
              <description>ADC group regular sequencer
              discontinuous mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DISCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Discontinuous mode on regular channels disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Discontinuous mode on regular channels enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AUTDLY</name>
              <description>ADC low power auto wait</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AUTDLY</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>Auto delayed conversion mode off</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>Auto delayed conversion mode on</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CONT</name>
              <description>ADC group regular continuous conversion
              mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CONT</name><usage>read-write</usage><enumeratedValue><name>Single</name><description>Single conversion mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Continuous</name><description>Continuous conversion mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVRMOD</name>
              <description>ADC group regular overrun
              configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVRMOD</name><usage>read-write</usage><enumeratedValue><name>Preserve</name><description>Preserve DR register when an overrun is detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Overwrite</name><description>Overwrite DR register when an overrun is detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTEN</name>
              <description>ADC group regular external trigger
              polarity</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>EXTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Trigger detection disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Trigger detection on the rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Trigger detection on the falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Trigger detection on both the rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTSEL</name>
              <description>ADC group regular external trigger
              source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            <enumeratedValues><name>EXTSEL</name><usage>read-write</usage><enumeratedValue><name>TIM4_CC4</name><description>Timer 4 CC4 event</description><value>5</value></enumeratedValue><enumeratedValue><name>TIM8_TRGO</name><description>Timer 8 TRGO event</description><value>7</value></enumeratedValue><enumeratedValue><name>TIM8_TRGO2</name><description>Timer 8 TRGO2 event</description><value>8</value></enumeratedValue><enumeratedValue><name>TIM4_TRGO</name><description>Timer 4 TRGO event</description><value>12</value></enumeratedValue><enumeratedValue><name>HRTIM1_ADCTRG1</name><description>HRTIM1_ADCTRG1 event</description><value>16</value></enumeratedValue><enumeratedValue><name>HRTIM1_ADCTRG3</name><description>HRTIM1_ADCTRG3 event</description><value>17</value></enumeratedValue><enumeratedValue><name>LPTIM1_OUT</name><description>LPTIM1_OUT event</description><value>18</value></enumeratedValue><enumeratedValue><name>LPTIM2_OUT</name><description>LPTIM2_OUT event</description><value>19</value></enumeratedValue><enumeratedValue><name>LPTIM3_OUT</name><description>LPTIM3_OUT event</description><value>20</value></enumeratedValue><enumeratedValue><name>TIM1_CC1</name><description>Timer 1 CC1 event</description><value>0</value></enumeratedValue><enumeratedValue><name>TIM1_CC2</name><description>Timer 1 CC2 event</description><value>1</value></enumeratedValue><enumeratedValue><name>TIM1_CC3</name><description>Timer 1 CC3 event</description><value>2</value></enumeratedValue><enumeratedValue><name>TIM2_CC2</name><description>Timer 2 CC2 event</description><value>3</value></enumeratedValue><enumeratedValue><name>TIM3_TRGO</name><description>Timer 3 TRGO event</description><value>4</value></enumeratedValue><enumeratedValue><name>EXTI11</name><description>EXTI line 11</description><value>6</value></enumeratedValue><enumeratedValue><name>TIM1_TRGO</name><description>Timer 1 TRGO event</description><value>9</value></enumeratedValue><enumeratedValue><name>TIM1_TRGO2</name><description>Timer 1 TRGO2 event</description><value>10</value></enumeratedValue><enumeratedValue><name>TIM2_TRGO</name><description>Timer 2 TRGO event</description><value>11</value></enumeratedValue><enumeratedValue><name>TIM6_TRGO</name><description>Timer 6 TRGO event</description><value>13</value></enumeratedValue><enumeratedValue><name>TIM15_TRGO</name><description>Timer 15 TRGO event</description><value>14</value></enumeratedValue><enumeratedValue><name>TIM3_CC4</name><description>Timer 3 CC4 event</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RES</name>
              <description>ADC data resolution</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>RES</name><usage>read-write</usage><enumeratedValue><name>SixteenBit</name><description>16-bit resolution</description><value>0</value></enumeratedValue><enumeratedValue><name>FourteenBit</name><description>14-bit resolution in legacy mode (not optimized power consumption)</description><value>1</value></enumeratedValue><enumeratedValue><name>TwelveBit</name><description>12-bit resolution in legacy mode (not optimized power consumption)</description><value>2</value></enumeratedValue><enumeratedValue><name>TenBit</name><description>10-bit resolution</description><value>3</value></enumeratedValue><enumeratedValue><name>FourteenBitV</name><description>14-bit resolution</description><value>5</value></enumeratedValue><enumeratedValue><name>TwelveBitV</name><description>12-bit resolution</description><value>6</value></enumeratedValue><enumeratedValue><name>EightBit</name><description>8-bit resolution</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMNGT</name>
              <description>ADC DMA transfer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>DMNGT</name><usage>read-write</usage><enumeratedValue><name>DR</name><description>Store output data in DR only</description><value>0</value></enumeratedValue><enumeratedValue><name>DMA_OneShot</name><description>DMA One Shot Mode selected</description><value>1</value></enumeratedValue><enumeratedValue><name>DFSDM</name><description>DFSDM mode selected</description><value>2</value></enumeratedValue><enumeratedValue><name>DMA_Circular</name><description>DMA Circular Mode selected</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
