probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        <register>
          <name>D1CFGR</name>
          <displayName>D1CFGR</displayName>
          <description>RCC Domain 1 Clock Configuration
          Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HPRE</name>
              <description>D1 domain AHB prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <enumeratedValues><name>HPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>sys_ck not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>sys_ck divided by 2</description><value>8</value></enumeratedValue><enumeratedValue><name>Div4</name><description>sys_ck divided by 4</description><value>9</value></enumeratedValue><enumeratedValue><name>Div8</name><description>sys_ck divided by 8</description><value>10</value></enumeratedValue><enumeratedValue><name>Div16</name><description>sys_ck divided by 16</description><value>11</value></enumeratedValue><enumeratedValue><name>Div64</name><description>sys_ck divided by 64</description><value>12</value></enumeratedValue><enumeratedValue><name>Div128</name><description>sys_ck divided by 128</description><value>13</value></enumeratedValue><enumeratedValue><name>Div256</name><description>sys_ck divided by 256</description><value>14</value></enumeratedValue><enumeratedValue><name>Div512</name><description>sys_ck divided by 512</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>D1PPRE</name>
              <description>D1 domain APB3 prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>D1PPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>rcc_hclk not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>rcc_hclk divided by 2</description><value>4</value></enumeratedValue><enumeratedValue><name>Div4</name><description>rcc_hclk divided by 4</description><value>5</value></enumeratedValue><enumeratedValue><name>Div8</name><description>rcc_hclk divided by 8</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>rcc_hclk divided by 16</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>D1CPRE</name>
              <description>D1 domain Core prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            <enumeratedValues derivedFrom="HPRE"/>
            </field>
          </fields>
        </register>
        <register>
          <name>D2CFGR</name>
          <displayName>D2CFGR</displayName>
          <description>RCC Domain 2 Clock Configuration
          Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>D2PPRE1</name>
              <description>D2 domain APB1 prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>D2PPRE1</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>rcc_hclk not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>rcc_hclk divided by 2</description><value>4</value></enumeratedValue><enumeratedValue><name>Div4</name><description>rcc_hclk divided by 4</description><value>5</value></enumeratedValue><enumeratedValue><name>Div8</name><description>rcc_hclk divided by 8</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>rcc_hclk divided by 16</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>D2PPRE2</name>
              <description>D2 domain APB2 prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="D2PPRE1"/>
            </field>
          </fields>
        </register>
        <register>
          <name>D3CFGR</name>
          <displayName>D3CFGR</displayName>
          <description>RCC Domain 3 Clock Configuration
          Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>D3PPRE</name><description>D3 domain APB4 prescaler</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><enumeratedValues><name>D3PPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>rcc_hclk not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>rcc_hclk divided by 2</description><value>4</value></enumeratedValue><enumeratedValue><name>Div4</name><description>rcc_hclk divided by 4</description><value>5</value></enumeratedValue><enumeratedValue><name>Div8</name><description>rcc_hclk divided by 8</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>rcc_hclk divided by 16</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        </register>
        <register>
          <name>PLLCKSELR</name>
          <displayName>PLLCKSELR</displayName>
          <description>RCC PLLs Clock Source Selection
          Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02020200</resetValue>
          <fields>
            <field>
              <name>PLLSRC</name>
              <description>DIVMx and PLLs clock source
              selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PLLSRC</name><usage>read-write</usage><enumeratedValue><name>HSI</name><description>HSI selected as PLL clock</description><value>0</value></enumeratedValue><enumeratedValue><name>CSI</name><description>CSI selected as PLL clock</description><value>1</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE selected as PLL clock</description><value>2</value></enumeratedValue><enumeratedValue><name>None</name><description>No clock sent to DIVMx dividers and PLLs</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DIVM1</name>
              <description>Prescaler for PLL1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVM2</name>
              <description>Prescaler for PLL2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVM3</name>
              <description>Prescaler for PLL3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>RCC PLLs Configuration
          Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x01FF0000</resetValue>
          <fields>
            <field>
              <name>PLL1FRACEN</name>
              <description>PLL1 fractional latch
              enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PLL1FRACEN</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>Reset latch to tranfer FRACN to the Sigma-Delta modulator</description><value>0</value></enumeratedValue><enumeratedValue><name>Set</name><description>Set latch to tranfer FRACN to the Sigma-Delta modulator</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PLL1VCOSEL</name>
              <description>PLL1 VCO selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PLL1VCOSEL</name><usage>read-write</usage><enumeratedValue><name>WideVCO</name><description>VCO frequency range 192 to 836 MHz</description><value>0</value></enumeratedValue><enumeratedValue><name>MediumVCO</name><description>VCO frequency range 150 to 420 MHz</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PLL1RGE</name>
              <description>PLL1 input frequency range</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PLL1RGE</name><usage>read-write</usage><enumeratedValue><name>Range1</name><description>Frequency is between 1 and 2 MHz</description><value>0</value></enumeratedValue><enumeratedValue><name>Range2</name><description>Frequency is between 2 and 4 MHz</description><value>1</value></enumeratedValue><enumeratedValue><name>Range4</name><description>Frequency is between 4 and 8 MHz</description><value>2</value></enumeratedValue><enumeratedValue><name>Range8</name><description>Frequency is between 8 and 16 MHz</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PLL2FRACEN</name>
              <description>PLL2 fractional latch
              enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PLL1FRACEN"/>
            </field>
            <field>
              <name>PLL2VCOSEL</name>
              <description>PLL2 VCO selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PLL1VCOSEL"/>
            </field>
            <field>
              <name>PLL2RGE</name>
              <description>PLL2 input frequency range</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PLL1RGE"/>
            </field>
            <field>
              <name>PLL3FRACEN</name>
              <description>PLL3 fractional latch
              enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PLL1FRACEN"/>
            </field>
            <field>
              <name>PLL3VCOSEL</name>
              <description>PLL3 VCO selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PLL1VCOSEL"/>
            </field>
            <field>
              <name>PLL3RGE</name>
              <description>PLL3 input frequency range</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PLL1RGE"/>
            </field>
            <field>
              <name>DIVP1EN</name>
              <description>PLL1 DIVP divider output
              enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DIVP1EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock ouput is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock output is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DIVQ1EN</name>
              <description>PLL1 DIVQ divider output
              enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVR1EN</name>
              <description>PLL1 DIVR divider output
              enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVP2EN</name>
              <description>PLL2 DIVP divider output
              enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVQ2EN</name>
              <description>PLL2 DIVQ divider output
              enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVR2EN</name>
              <description>PLL2 DIVR divider output
              enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVP3EN</name>
              <description>PLL3 DIVP divider output
              enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVQ3EN</name>
              <description>PLL3 DIVQ divider output
              enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVR3EN</name>
              <description>PLL3 DIVR divider output
              enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
          </fields>
        </register>
