probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        <register>
          <name>PLL1DIVR</name>
          <displayName>PLL1DIVR</displayName>
          <description>RCC PLL1 Dividers Configuration
          Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x01010280</resetValue>
          <fields>
            <field>
              <name>DIVN1</name>
              <description>Multiplication factor for PLL1
              VCO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            <writeConstraint><range><minimum>3</minimum><maximum>511</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVP1</name>
              <description>PLL1 DIVP division factor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            <enumeratedValues><name>DIVP1</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>pll_p_ck = vco_ck</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>pll_p_ck = vco_ck / 2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>pll_p_ck = vco_ck / 4</description><value>3</value></enumeratedValue><enumeratedValue><name>Div6</name><description>pll_p_ck = vco_ck / 6</description><value>5</value></enumeratedValue><enumeratedValue><name>Div8</name><description>pll_p_ck = vco_ck / 8</description><value>7</value></enumeratedValue><enumeratedValue><name>Div10</name><description>pll_p_ck = vco_ck / 10</description><value>9</value></enumeratedValue><enumeratedValue><name>Div12</name><description>pll_p_ck = vco_ck / 12</description><value>11</value></enumeratedValue><enumeratedValue><name>Div14</name><description>pll_p_ck = vco_ck / 14</description><value>13</value></enumeratedValue><enumeratedValue><name>Div16</name><description>pll_p_ck = vco_ck / 16</description><value>15</value></enumeratedValue><enumeratedValue><name>Div18</name><description>pll_p_ck = vco_ck / 18</description><value>17</value></enumeratedValue><enumeratedValue><name>Div20</name><description>pll_p_ck = vco_ck / 20</description><value>19</value></enumeratedValue><enumeratedValue><name>Div22</name><description>pll_p_ck = vco_ck / 22</description><value>21</value></enumeratedValue><enumeratedValue><name>Div24</name><description>pll_p_ck = vco_ck / 24</description><value>23</value></enumeratedValue><enumeratedValue><name>Div26</name><description>pll_p_ck = vco_ck / 26</description><value>25</value></enumeratedValue><enumeratedValue><name>Div28</name><description>pll_p_ck = vco_ck / 28</description><value>27</value></enumeratedValue><enumeratedValue><name>Div30</name><description>pll_p_ck = vco_ck / 30</description><value>29</value></enumeratedValue><enumeratedValue><name>Div32</name><description>pll_p_ck = vco_ck / 32</description><value>31</value></enumeratedValue><enumeratedValue><name>Div34</name><description>pll_p_ck = vco_ck / 34</description><value>33</value></enumeratedValue><enumeratedValue><name>Div36</name><description>pll_p_ck = vco_ck / 36</description><value>35</value></enumeratedValue><enumeratedValue><name>Div38</name><description>pll_p_ck = vco_ck / 38</description><value>37</value></enumeratedValue><enumeratedValue><name>Div40</name><description>pll_p_ck = vco_ck / 40</description><value>39</value></enumeratedValue><enumeratedValue><name>Div42</name><description>pll_p_ck = vco_ck / 42</description><value>41</value></enumeratedValue><enumeratedValue><name>Div44</name><description>pll_p_ck = vco_ck / 44</description><value>43</value></enumeratedValue><enumeratedValue><name>Div46</name><description>pll_p_ck = vco_ck / 46</description><value>45</value></enumeratedValue><enumeratedValue><name>Div48</name><description>pll_p_ck = vco_ck / 48</description><value>47</value></enumeratedValue><enumeratedValue><name>Div50</name><description>pll_p_ck = vco_ck / 50</description><value>49</value></enumeratedValue><enumeratedValue><name>Div52</name><description>pll_p_ck = vco_ck / 52</description><value>51</value></enumeratedValue><enumeratedValue><name>Div54</name><description>pll_p_ck = vco_ck / 54</description><value>53</value></enumeratedValue><enumeratedValue><name>Div56</name><description>pll_p_ck = vco_ck / 56</description><value>55</value></enumeratedValue><enumeratedValue><name>Div58</name><description>pll_p_ck = vco_ck / 58</description><value>57</value></enumeratedValue><enumeratedValue><name>Div60</name><description>pll_p_ck = vco_ck / 60</description><value>59</value></enumeratedValue><enumeratedValue><name>Div62</name><description>pll_p_ck = vco_ck / 62</description><value>61</value></enumeratedValue><enumeratedValue><name>Div64</name><description>pll_p_ck = vco_ck / 64</description><value>63</value></enumeratedValue><enumeratedValue><name>Div66</name><description>pll_p_ck = vco_ck / 66</description><value>65</value></enumeratedValue><enumeratedValue><name>Div68</name><description>pll_p_ck = vco_ck / 68</description><value>67</value></enumeratedValue><enumeratedValue><name>Div70</name><description>pll_p_ck = vco_ck / 70</description><value>69</value></enumeratedValue><enumeratedValue><name>Div72</name><description>pll_p_ck = vco_ck / 72</description><value>71</value></enumeratedValue><enumeratedValue><name>Div74</name><description>pll_p_ck = vco_ck / 74</description><value>73</value></enumeratedValue><enumeratedValue><name>Div76</name><description>pll_p_ck = vco_ck / 76</description><value>75</value></enumeratedValue><enumeratedValue><name>Div78</name><description>pll_p_ck = vco_ck / 78</description><value>77</value></enumeratedValue><enumeratedValue><name>Div80</name><description>pll_p_ck = vco_ck / 80</description><value>79</value></enumeratedValue><enumeratedValue><name>Div82</name><description>pll_p_ck = vco_ck / 82</description><value>81</value></enumeratedValue><enumeratedValue><name>Div84</name><description>pll_p_ck = vco_ck / 84</description><value>83</value></enumeratedValue><enumeratedValue><name>Div86</name><description>pll_p_ck = vco_ck / 86</description><value>85</value></enumeratedValue><enumeratedValue><name>Div88</name><description>pll_p_ck = vco_ck / 88</description><value>87</value></enumeratedValue><enumeratedValue><name>Div90</name><description>pll_p_ck = vco_ck / 90</description><value>89</value></enumeratedValue><enumeratedValue><name>Div92</name><description>pll_p_ck = vco_ck / 92</description><value>91</value></enumeratedValue><enumeratedValue><name>Div94</name><description>pll_p_ck = vco_ck / 94</description><value>93</value></enumeratedValue><enumeratedValue><name>Div96</name><description>pll_p_ck = vco_ck / 96</description><value>95</value></enumeratedValue><enumeratedValue><name>Div98</name><description>pll_p_ck = vco_ck / 98</description><value>97</value></enumeratedValue><enumeratedValue><name>Div100</name><description>pll_p_ck = vco_ck / 100</description><value>99</value></enumeratedValue><enumeratedValue><name>Div102</name><description>pll_p_ck = vco_ck / 102</description><value>101</value></enumeratedValue><enumeratedValue><name>Div104</name><description>pll_p_ck = vco_ck / 104</description><value>103</value></enumeratedValue><enumeratedValue><name>Div106</name><description>pll_p_ck = vco_ck / 106</description><value>105</value></enumeratedValue><enumeratedValue><name>Div108</name><description>pll_p_ck = vco_ck / 108</description><value>107</value></enumeratedValue><enumeratedValue><name>Div110</name><description>pll_p_ck = vco_ck / 110</description><value>109</value></enumeratedValue><enumeratedValue><name>Div112</name><description>pll_p_ck = vco_ck / 112</description><value>111</value></enumeratedValue><enumeratedValue><name>Div114</name><description>pll_p_ck = vco_ck / 114</description><value>113</value></enumeratedValue><enumeratedValue><name>Div116</name><description>pll_p_ck = vco_ck / 116</description><value>115</value></enumeratedValue><enumeratedValue><name>Div118</name><description>pll_p_ck = vco_ck / 118</description><value>117</value></enumeratedValue><enumeratedValue><name>Div120</name><description>pll_p_ck = vco_ck / 120</description><value>119</value></enumeratedValue><enumeratedValue><name>Div122</name><description>pll_p_ck = vco_ck / 122</description><value>121</value></enumeratedValue><enumeratedValue><name>Div124</name><description>pll_p_ck = vco_ck / 124</description><value>123</value></enumeratedValue><enumeratedValue><name>Div126</name><description>pll_p_ck = vco_ck / 126</description><value>125</value></enumeratedValue><enumeratedValue><name>Div128</name><description>pll_p_ck = vco_ck / 128</description><value>127</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DIVQ1</name>
              <description>PLL1 DIVQ division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVR1</name>
              <description>PLL1 DIVR division factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1FRACR</name>
          <displayName>PLL1FRACR</displayName>
          <description>RCC PLL1 Fractional Divider
          Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRACN1</name>
              <description>Fractional part of the multiplication
              factor for PLL1 VCO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>8191</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2DIVR</name>
          <displayName>PLL2DIVR</displayName>
          <description>RCC PLL2 Dividers Configuration
          Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x01010280</resetValue>
          <fields>
            <field>
              <name>DIVN2</name>
              <description>Multiplication factor for PLL1
              VCO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            <writeConstraint><range><minimum>3</minimum><maximum>511</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVP2</name>
              <description>PLL1 DIVP division factor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVQ2</name>
              <description>PLL1 DIVQ division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVR2</name>
              <description>PLL1 DIVR division factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2FRACR</name>
          <displayName>PLL2FRACR</displayName>
          <description>RCC PLL2 Fractional Divider
          Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRACN2</name>
              <description>Fractional part of the multiplication
              factor for PLL VCO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>8191</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3DIVR</name>
          <displayName>PLL3DIVR</displayName>
          <description>RCC PLL3 Dividers Configuration
          Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x01010280</resetValue>
          <fields>
            <field>
              <name>DIVN3</name>
              <description>Multiplication factor for PLL1
              VCO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            <writeConstraint><range><minimum>3</minimum><maximum>511</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVP3</name>
              <description>PLL DIVP division factor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVQ3</name>
              <description>PLL DIVQ division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DIVR3</name>
              <description>PLL DIVR division factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3FRACR</name>
          <displayName>PLL3FRACR</displayName>
          <description>RCC PLL3 Fractional Divider
          Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRACN3</name>
              <description>Fractional part of the multiplication
              factor for PLL3 VCO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>8191</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>D1CCIPR</name>
          <displayName>D1CCIPR</displayName>
          <description>RCC Domain 1 Kernel Clock Configuration
          Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMCSEL</name>
              <description>FMC kernel clock source
              selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>FMCSEL</name><usage>read-write</usage><enumeratedValue><name>RCC_HCLK3</name><description>rcc_hclk3 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL1_Q</name><description>pll1_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL2_R</name><description>pll2_r selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>PER</name><description>PER selected as peripheral clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>QSPISEL</name>
              <description>QUADSPI kernel clock source
              selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="FMCSEL"/>
            </field>
            <field>
              <name>SDMMCSEL</name>
              <description>SDMMC kernel clock source
              selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SDMMCSEL</name><usage>read-write</usage><enumeratedValue><name>PLL1_Q</name><description>pll1_q selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_R</name><description>pll2_r selected as peripheral clock</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKPERSEL</name>
              <description>per_ck clock source
              selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>CKPERSEL</name><usage>read-write</usage><enumeratedValue><name>HSI</name><description>HSI selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>CSI</name><description>CSI selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE selected as peripheral clock</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
          <field><name>DSISEL</name><description>kernel clock source selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            </fields>
        </register>
