probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        <register>
          <name>D3AMR</name>
          <displayName>D3AMR</displayName>
          <description>RCC D3 Autonomous mode
          Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BDMAAMEN</name>
              <description>BDMA and DMAMUX Autonomous mode
              enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BDMAAMEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock disabled in autonomous mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock enabled in autonomous mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LPUART1AMEN</name>
              <description>LPUART1 Autonomous mode
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>SPI6AMEN</name>
              <description>SPI6 Autonomous mode
              enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>I2C4AMEN</name>
              <description>I2C4 Autonomous mode
              enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>LPTIM2AMEN</name>
              <description>LPTIM2 Autonomous mode
              enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>LPTIM3AMEN</name>
              <description>LPTIM3 Autonomous mode
              enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>LPTIM4AMEN</name>
              <description>LPTIM4 Autonomous mode
              enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>LPTIM5AMEN</name>
              <description>LPTIM5 Autonomous mode
              enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>COMP12AMEN</name>
              <description>COMP12 Autonomous mode
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>VREFAMEN</name>
              <description>VREF Autonomous mode
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>RTCAMEN</name>
              <description>RTC Autonomous mode enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>CRCAMEN</name>
              <description>CRC Autonomous mode enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>SAI4AMEN</name>
              <description>SAI4 Autonomous mode
              enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>ADC3AMEN</name>
              <description>ADC3 Autonomous mode
              enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>BKPSRAMAMEN</name>
              <description>Backup RAM Autonomous mode
              enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
            <field>
              <name>SRAM4AMEN</name>
              <description>SRAM4 Autonomous mode
              enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BDMAAMEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>RSR</name>
          <displayName>RSR</displayName>
          <description>RCC Reset Status Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMVF</name>
              <description>Remove reset flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RMVF</name><usage>read-write</usage><enumeratedValue><name>NotActive</name><description>Not clearing the the reset flags</description><value>0</value></enumeratedValue><enumeratedValue><name>Clear</name><description>Clear the reset flags</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CPURSTF</name>
              <description>CPU reset flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CPURSTFR</name><usage>read</usage><enumeratedValue><name>NoResetOccoured</name><description>No reset occoured for block</description><value>0</value></enumeratedValue><enumeratedValue><name>ResetOccourred</name><description>Reset occoured for block</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>D1RSTF</name>
              <description>D1 domain power switch reset
              flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>D2RSTF</name>
              <description>D2 domain power switch reset
              flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BOR reset flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>Pin reset flag (NRST)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>POR/PDR reset flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>System reset from CPU reset
              flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>IWDG1RSTF</name>
              <description>Independent Watchdog reset
              flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>WWDG1RSTF</name>
              <description>Window Watchdog reset flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <description>Reset due to illegal D1 DStandby or CPU
              CStop flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
          </fields>
        </register>
        <register>
          <name>C1_RSR</name>
          <displayName>C1_RSR</displayName>
          <description>RCC Reset Status Register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMVF</name>
              <description>Remove reset flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RMVF</name><usage>read-write</usage><enumeratedValue><name>NotActive</name><description>Not clearing the the reset flags</description><value>0</value></enumeratedValue><enumeratedValue><name>Clear</name><description>Clear the reset flags</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CPURSTF</name>
              <description>CPU reset flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CPURSTFR</name><usage>read</usage><enumeratedValue><name>NoResetOccoured</name><description>No reset occoured for block</description><value>0</value></enumeratedValue><enumeratedValue><name>ResetOccourred</name><description>Reset occoured for block</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>D1RSTF</name>
              <description>D1 domain power switch reset
              flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>D2RSTF</name>
              <description>D2 domain power switch reset
              flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BOR reset flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>Pin reset flag (NRST)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>POR/PDR reset flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>System reset from CPU reset
              flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>IWDG1RSTF</name>
              <description>Independent Watchdog reset
              flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>WWDG1RSTF</name>
              <description>Window Watchdog reset flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <description>Reset due to illegal D1 DStandby or CPU
              CStop flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CPURSTFR"/>
            </field>
          </fields>
        </register>
        <register>
          <name>C1_AHB3ENR</name>
          <displayName>C1_AHB3ENR</displayName>
          <description>RCC AHB3 Clock Register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMAEN</name>
              <description>MDMA Peripheral Clock
              Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MDMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>The selected clock is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>The selected clock is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMA2DEN</name>
              <description>DMA2D Peripheral Clock
              Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>JPGDECEN</name>
              <description>JPGDEC Peripheral Clock
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC Peripheral Clocks
              Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>QSPIEN</name>
              <description>QUADSPI and QUADSPI Delay Clock
              Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>SDMMC1EN</name>
              <description>SDMMC1 and SDMMC1 Delay Clock
              Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3ENR</name>
          <displayName>AHB3ENR</displayName>
          <description>RCC AHB3 Clock Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMAEN</name>
              <description>MDMA Peripheral Clock
              Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MDMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>The selected clock is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>The selected clock is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMA2DEN</name>
              <description>DMA2D Peripheral Clock
              Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>JPGDECEN</name>
              <description>JPGDEC Peripheral Clock
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC Peripheral Clocks
              Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>QSPIEN</name>
              <description>QUADSPI and QUADSPI Delay Clock
              Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field>
              <name>SDMMC1EN</name>
              <description>SDMMC1 and SDMMC1 Delay Clock
              Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MDMAEN"/>
            </field>
          <field><name>DTCM1EN</name><description>D1 DTCM1 block enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field><name>DTCM2EN</name><description>D1 DTCM2 block enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field><name>ITCM1EN</name><description>D1 ITCM block enable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            <field><name>AXISRAMEN</name><description>AXISRAM block enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MDMAEN"/>
            </field>
            </fields>
        </register>
        <register>
          <name>AHB1ENR</name>
          <displayName>AHB1ENR</displayName>
          <description>RCC AHB1 Clock Register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA1EN</name>
              <description>DMA1 Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DMA1EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>The selected clock is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>The selected clock is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMA2EN</name>
              <description>DMA2 Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            <field>
              <name>ADC12EN</name>
              <description>ADC1/2 Peripheral Clocks
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            <field>
              <name>ETH1MACEN</name>
              <description>Ethernet MAC bus interface Clock
              Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            <field>
              <name>ETH1TXEN</name>
              <description>Ethernet Transmission Clock
              Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            <field>
              <name>ETH1RXEN</name>
              <description>Ethernet Reception Clock
              Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            <field>
              <name>USB1OTGEN</name>
              <description>USB1OTG Peripheral Clocks
              Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            <field>
              <name>USB1ULPIEN</name>
              <description>USB_PHY1 Clocks Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            <field>
              <name>USB2OTGEN</name>
              <description>USB2OTG Peripheral Clocks
              Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            <field>
              <name>USB2ULPIEN</name>
              <description>USB_PHY2 Clocks Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
          <field><name>ARTEN</name><description>ART Clock Enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="DMA1EN"/>
            </field>
            </fields>
        </register>
