probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
        <register>
          <name>C1_APB4LPENR</name>
          <displayName>C1_APB4LPENR</displayName>
          <description>RCC APB4 Sleep Clock Register</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYSCFGLPEN</name>
              <description>SYSCFG peripheral clock enable during
              CSleep mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SYSCFGLPEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>The selected clock is disabled during csleep mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>The selected clock is enabled during csleep mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LPUART1LPEN</name>
              <description>LPUART1 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>SPI6LPEN</name>
              <description>SPI6 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>I2C4LPEN</name>
              <description>I2C4 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>LPTIM2LPEN</name>
              <description>LPTIM2 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>LPTIM3LPEN</name>
              <description>LPTIM3 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>LPTIM4LPEN</name>
              <description>LPTIM4 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>LPTIM5LPEN</name>
              <description>LPTIM5 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>COMP12LPEN</name>
              <description>COMP1/2 peripheral clock enable during
              CSleep mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>VREFLPEN</name>
              <description>VREF peripheral clock enable during
              CSleep mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>RTCAPBLPEN</name>
              <description>RTC APB Clock Enable During CSleep
              Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>SAI4LPEN</name>
              <description>SAI4 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>APB4LPENR</name>
          <displayName>APB4LPENR</displayName>
          <description>RCC APB4 Sleep Clock Register</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYSCFGLPEN</name>
              <description>SYSCFG peripheral clock enable during
              CSleep mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SYSCFGLPEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>The selected clock is disabled during csleep mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>The selected clock is enabled during csleep mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LPUART1LPEN</name>
              <description>LPUART1 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>SPI6LPEN</name>
              <description>SPI6 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>I2C4LPEN</name>
              <description>I2C4 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>LPTIM2LPEN</name>
              <description>LPTIM2 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>LPTIM3LPEN</name>
              <description>LPTIM3 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>LPTIM4LPEN</name>
              <description>LPTIM4 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>LPTIM5LPEN</name>
              <description>LPTIM5 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>COMP12LPEN</name>
              <description>COMP1/2 peripheral clock enable during
              CSleep mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>VREFLPEN</name>
              <description>VREF peripheral clock enable during
              CSleep mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>RTCAPBLPEN</name>
              <description>RTC APB Clock Enable During CSleep
              Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
            <field>
              <name>SAI4LPEN</name>
              <description>SAI4 Peripheral Clocks Enable During
              CSleep Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SYSCFGLPEN"/>
            </field>
          </fields>
        </register>
      <register><name>HSICFGR</name><description>RCC HSI configuration register</description><addressOffset>4</addressOffset><access>read-write</access><fields><field><name>HSITRIM</name><description>HSI clock trimming</description><bitOffset>24</bitOffset><bitWidth>7</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
            <field><name>HSICAL</name><description>HSI clock calibration</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>CSICFGR</name><description>RCC CSI configuration register</description><addressOffset>12</addressOffset><access>read-write</access><fields><field><name>CSITRIM</name><description>CSI clock trimming</description><bitOffset>24</bitOffset><bitWidth>6</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
            <field><name>CSICAL</name><description>CSI clock calibration</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        </registers>
    </peripheral>
    <peripheral>
      <name>LPTIM1</name>
      <description>Low power timer</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPTIM1</name>
        <description>LPTIM1 global interrupt</description>
        <value>93</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>Interrupt and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOWN</name>
              <description>Counter direction change up to
              down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DOWNR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Counter direction change up to down</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UP</name>
              <description>Counter direction change down to
              up</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UPR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Counter direction change down to up</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARROK</name>
              <description>Autoreload register update
              OK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARROKR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Autoreload register update OK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPOK</name>
              <description>Compare register update OK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPOKR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Compare register update OK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTTRIG</name>
              <description>External trigger edge
              event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EXTTRIGR</name><usage>read</usage><enumeratedValue><name>Set</name><description>External trigger edge event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARRM</name>
              <description>Autoreload match</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARRMR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Autoreload match</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPM</name>
              <description>Compare match</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPMR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Compare match</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOWNCF</name>
              <description>Direction change to down Clear
              Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DOWNCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Direction change to down Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UPCF</name>
              <description>Direction change to UP Clear
              Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UPCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Direction change to up Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARROKCF</name>
              <description>Autoreload register update OK Clear
              Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARROKCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Autoreload register update OK Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPOKCF</name>
              <description>Compare register update OK Clear
              Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPOKCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Compare register update OK Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTTRIGCF</name>
              <description>External trigger valid edge Clear
              Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EXTTRIGCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>External trigger valid edge Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARRMCF</name>
              <description>Autoreload match Clear
              Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARRMCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Autoreload match Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPMCF</name>
              <description>compare match Clear Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPMCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Compare match Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOWNIE</name>
              <description>Direction change to down Interrupt
              Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DOWNIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DOWN interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DOWN interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UPIE</name>
              <description>Direction change to UP Interrupt
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UPIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>UP interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>UP interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARROKIE</name>
              <description>Autoreload register update OK Interrupt
              Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARROKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ARROK interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ARROK interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPOKIE</name>
              <description>Compare register update OK Interrupt
              Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPOKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CMPOK interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CMPOK interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTTRIGIE</name>
              <description>External trigger valid edge Interrupt
              Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EXTTRIGIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>EXTTRIG interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>EXTTRIG interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARRMIE</name>
              <description>Autoreload match Interrupt
              Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARRMIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ARRM interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ARRM interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPMIE</name>
              <description>Compare match Interrupt
              Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPMIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CMPM interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CMPM interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
