probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPTIM1">
      <name>LPTIM2</name>
      <baseAddress>0x58002400</baseAddress>
      <interrupt>
        <name>LPTIM2</name>
        <description>LPTIM2 timer interrupt</description>
        <value>138</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>LPTIM3</name>
      <description>Low power timer</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x58002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPTIM3</name>
        <description>LPTIM2 timer interrupt</description>
        <value>139</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>Interrupt and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOWN</name>
              <description>Counter direction change up to
              down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DOWNR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Counter direction change up to down</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UP</name>
              <description>Counter direction change down to
              up</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UPR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Counter direction change down to up</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARROK</name>
              <description>Autoreload register update
              OK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARROKR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Autoreload register update OK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPOK</name>
              <description>Compare register update OK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPOKR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Compare register update OK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTTRIG</name>
              <description>External trigger edge
              event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EXTTRIGR</name><usage>read</usage><enumeratedValue><name>Set</name><description>External trigger edge event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARRM</name>
              <description>Autoreload match</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARRMR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Autoreload match</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPM</name>
              <description>Compare match</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPMR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Compare match</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOWNCF</name>
              <description>Direction change to down Clear
              Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DOWNCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Direction change to down Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UPCF</name>
              <description>Direction change to UP Clear
              Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UPCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Direction change to up Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARROKCF</name>
              <description>Autoreload register update OK Clear
              Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARROKCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Autoreload register update OK Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPOKCF</name>
              <description>Compare register update OK Clear
              Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPOKCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Compare register update OK Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTTRIGCF</name>
              <description>External trigger valid edge Clear
              Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EXTTRIGCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>External trigger valid edge Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARRMCF</name>
              <description>Autoreload match Clear
              Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARRMCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Autoreload match Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPMCF</name>
              <description>compare match Clear Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPMCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Compare match Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOWNIE</name>
              <description>Direction change to down Interrupt
              Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DOWNIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DOWN interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DOWN interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UPIE</name>
              <description>Direction change to UP Interrupt
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UPIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>UP interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>UP interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARROKIE</name>
              <description>Autoreload register update OK Interrupt
              Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARROKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ARROK interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ARROK interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPOKIE</name>
              <description>Compare register update OK Interrupt
              Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPOKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CMPOK interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CMPOK interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTTRIGIE</name>
              <description>External trigger valid edge Interrupt
              Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EXTTRIGIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>EXTTRIG interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>EXTTRIG interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARRMIE</name>
              <description>Autoreload match Interrupt
              Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ARRMIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ARRM interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ARRM interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMPMIE</name>
              <description>Compare match Interrupt
              Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMPMIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CMPM interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CMPM interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENC</name>
              <description>Encoder mode enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ENC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Encoder mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Encoder mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COUNTMODE</name>
              <description>counter mode enabled</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>COUNTMODE</name><usage>read-write</usage><enumeratedValue><name>Internal</name><description>The counter is incremented following each internal clock pulse</description><value>0</value></enumeratedValue><enumeratedValue><name>External</name><description>The counter is incremented following each valid clock pulse on the LPTIM external Input1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PRELOAD</name>
              <description>Registers update mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PRELOAD</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Registers are updated after each APB bus write access</description><value>0</value></enumeratedValue><enumeratedValue><name>EndOfPeriod</name><description>Registers are updated at the end of the current LPTIM period</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAVPOL</name>
              <description>Waveform shape polarity</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAVPOL</name><usage>read-write</usage><enumeratedValue><name>Positive</name><description>The LPTIM output reflects the compare results between LPTIM_ARR and LPTIM_CMP registers</description><value>0</value></enumeratedValue><enumeratedValue><name>Negative</name><description>The LPTIM output reflects the inverse of the compare results between LPTIM_ARR and LPTIM_CMP registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAVE</name>
              <description>Waveform shape</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAVE</name><usage>read-write</usage><enumeratedValue><name>Inactive</name><description>Deactivate Set-once mode, PWM / One Pulse waveform (depending on OPMODE bit)</description><value>0</value></enumeratedValue><enumeratedValue><name>Active</name><description>Activate the Set-once mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TIMOUT</name>
              <description>Timeout enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TIMOUT</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>A trigger event arriving when the timer is already started will be ignored</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>A trigger event arriving when the timer is already started will reset and restart the counter</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TRIGEN</name>
              <description>Trigger enable and
              polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>TRIGEN</name><usage>read-write</usage><enumeratedValue><name>SW</name><description>Software trigger (counting start is initiated by software)</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge is the active edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge is the active edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Both edges are active edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TRIGSEL</name>
              <description>Trigger selector</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>TRIGSEL</name><usage>read-write</usage><enumeratedValue><name>Trig0</name><description>lptim_ext_trig0</description><value>0</value></enumeratedValue><enumeratedValue><name>Trig1</name><description>lptim_ext_trig1</description><value>1</value></enumeratedValue><enumeratedValue><name>Trig2</name><description>lptim_ext_trig2</description><value>2</value></enumeratedValue><enumeratedValue><name>Trig3</name><description>lptim_ext_trig3</description><value>3</value></enumeratedValue><enumeratedValue><name>Trig4</name><description>lptim_ext_trig4</description><value>4</value></enumeratedValue><enumeratedValue><name>Trig5</name><description>lptim_ext_trig5</description><value>5</value></enumeratedValue><enumeratedValue><name>Trig6</name><description>lptim_ext_trig6</description><value>6</value></enumeratedValue><enumeratedValue><name>Trig7</name><description>lptim_ext_trig7</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>Clock prescaler</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>PRESC</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>/1</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>/2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>/4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div8</name><description>/8</description><value>3</value></enumeratedValue><enumeratedValue><name>Div16</name><description>/16</description><value>4</value></enumeratedValue><enumeratedValue><name>Div32</name><description>/32</description><value>5</value></enumeratedValue><enumeratedValue><name>Div64</name><description>/64</description><value>6</value></enumeratedValue><enumeratedValue><name>Div128</name><description>/128</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TRGFLT</name>
              <description>Configurable digital filter for
              trigger</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>TRGFLT</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Any trigger active level change is considered as a valid trigger</description><value>0</value></enumeratedValue><enumeratedValue><name>Clocks2</name><description>Trigger active level change must be stable for at least 2 clock periods before it is considered as valid trigger</description><value>1</value></enumeratedValue><enumeratedValue><name>Clocks4</name><description>Trigger active level change must be stable for at least 4 clock periods before it is considered as valid trigger</description><value>2</value></enumeratedValue><enumeratedValue><name>Clocks8</name><description>Trigger active level change must be stable for at least 8 clock periods before it is considered as valid trigger</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKFLT</name>
              <description>Configurable digital filter for external
              clock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>CKFLT</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Any external clock signal level change is considered as a valid transition</description><value>0</value></enumeratedValue><enumeratedValue><name>Clocks2</name><description>External clock signal level change must be stable for at least 2 clock periods before it is considered as valid transition</description><value>1</value></enumeratedValue><enumeratedValue><name>Clocks4</name><description>External clock signal level change must be stable for at least 4 clock periods before it is considered as valid transition</description><value>2</value></enumeratedValue><enumeratedValue><name>Clocks8</name><description>External clock signal level change must be stable for at least 8 clock periods before it is considered as valid transition</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKPOL</name>
              <description>Clock Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>CKPOL</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>The rising edge is the active edge used for counting. If LPTIM is in encoder mode: Encoder sub-mode 1 is active.</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>The falling edge is the active edge used for counting. If LPTIM is in encoder mode: Encoder sub-mode 2 is active.</description><value>1</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Both edges are active edge. If LPTIM is in encoder mode: Encoder sub-mode 3 is active.</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKSEL</name>
              <description>Clock selector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CKSEL</name><usage>read-write</usage><enumeratedValue><name>Internal</name><description>LPTIM is clocked by internal clock source (APB clock or any of the embedded oscillators)</description><value>0</value></enumeratedValue><enumeratedValue><name>External</name><description>LPTIM is clocked by an external clock source through the LPTIM external Input1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
