probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA1</name>
      <description>DMA controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_STR0</name>
        <description>DMA1 Stream0</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA_STR1</name>
        <description>DMA1 Stream1</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA_STR2</name>
        <description>DMA1 Stream2</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA_STR3</name>
        <description>DMA1 Stream3</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA_STR4</name>
        <description>DMA1 Stream4</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA_STR5</name>
        <description>DMA1 Stream5</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>DMA_STR6</name>
        <description>DMA1 Stream6</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>DMA1_STR7</name>
        <description>DMA1 Stream7</description>
        <value>47</value>
      </interrupt>
      <interrupt><name>DMA1_STR0</name><description>DMA1 Stream0</description><value>11</value></interrupt>
    <interrupt><name>DMA1_STR1</name><description>DMA1 Stream1</description><value>12</value></interrupt>
    <interrupt><name>DMA1_STR2</name><description>DMA1 Stream2</description><value>13</value></interrupt>
    <interrupt><name>DMA1_STR3</name><description>DMA1 Stream3</description><value>14</value></interrupt>
    <interrupt><name>DMA1_STR4</name><description>DMA1 Stream4</description><value>15</value></interrupt>
    <interrupt><name>DMA1_STR5</name><description>DMA1 Stream5</description><value>16</value></interrupt>
    <interrupt><name>DMA1_STR6</name><description>DMA1 Stream6</description><value>17</value></interrupt>
    <registers>
        <cluster><dim>8</dim><dimIncrement>0x18</dimIncrement><dimIndex>0,1,2,3,4,5,6,7</dimIndex><name>ST%s</name><description>Stream cluster: S?CR, S?NDTR, S?M0AR, S?M1AR and S?FCR registers</description><addressOffset>0x10</addressOffset><register>
          <name>CR</name>
          <displayName>S0CR</displayName>
          <description>stream x configuration
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MBURST</name>
              <description>Memory burst transfer
              configuration</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PBURST"/>
            </field>
            <field>
              <name>PBURST</name>
              <description>Peripheral burst transfer
              configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PBURST</name><usage>read-write</usage><enumeratedValue><name>Single</name><description>Single transfer</description><value>0</value></enumeratedValue><enumeratedValue><name>INCR4</name><description>Incremental burst of 4 beats</description><value>1</value></enumeratedValue><enumeratedValue><name>INCR8</name><description>Incremental burst of 8 beats</description><value>2</value></enumeratedValue><enumeratedValue><name>INCR16</name><description>Incremental burst of 16 beats</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CT</name>
              <description>Current target (only in double buffer
              mode)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CT</name><usage>read-write</usage><enumeratedValue><name>Memory0</name><description>The current target memory is Memory 0</description><value>0</value></enumeratedValue><enumeratedValue><name>Memory1</name><description>The current target memory is Memory 1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DBM</name>
              <description>Double buffer mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DBM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No buffer switching at the end of transfer</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Memory target switched at the end of the DMA transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PL</name>
              <description>Priority level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PL</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Low</description><value>0</value></enumeratedValue><enumeratedValue><name>Medium</name><description>Medium</description><value>1</value></enumeratedValue><enumeratedValue><name>High</name><description>High</description><value>2</value></enumeratedValue><enumeratedValue><name>VeryHigh</name><description>Very high</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PINCOS</name>
              <description>Peripheral increment offset
              size</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PINCOS</name><usage>read-write</usage><enumeratedValue><name>PSIZE</name><description>The offset size for the peripheral address calculation is linked to the PSIZE</description><value>0</value></enumeratedValue><enumeratedValue><name>Fixed4</name><description>The offset size for the peripheral address calculation is fixed to 4 (32-bit alignment)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory data size</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PSIZE"/>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral data size</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PSIZE</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>Byte (8-bit)</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>Half-word (16-bit)</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>Word (32-bit)</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PINC"/>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PINC</name><usage>read-write</usage><enumeratedValue><name>Fixed</name><description>Address pointer is fixed</description><value>0</value></enumeratedValue><enumeratedValue><name>Incremented</name><description>Address pointer is incremented after each data transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CIRC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Circular mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Circular mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>DIR</name><usage>read-write</usage><enumeratedValue><name>PeripheralToMemory</name><description>Peripheral-to-memory</description><value>0</value></enumeratedValue><enumeratedValue><name>MemoryToPeripheral</name><description>Memory-to-peripheral</description><value>1</value></enumeratedValue><enumeratedValue><name>MemoryToMemory</name><description>Memory-to-memory</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PFCTRL</name>
              <description>Peripheral flow controller</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PFCTRL</name><usage>read-write</usage><enumeratedValue><name>DMA</name><description>The DMA is the flow controller</description><value>0</value></enumeratedValue><enumeratedValue><name>Peripheral</name><description>The peripheral is the flow controller</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt
              enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>TC interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>TC interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half transfer interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>HTIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>HT interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>HT interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>TE interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>TE interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMEIE</name>
              <description>Direct mode error interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DMEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DME interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DME interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>Stream enable / flag stream ready when
              read low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Stream disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Stream enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          <field><name>TRBUFF</name><description>Enable the DMA to handle bufferable transfers</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues><name>TRBUFF</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Bufferable transfers not enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Bufferable transfers enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        </register>
        <register>
          <name>NDTR</name>
          <displayName>S0NDTR</displayName>
          <description>stream x number of data
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data items to
              transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PAR</name>
          <displayName>S0PAR</displayName>
          <description>stream x peripheral address
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M0AR</name>
          <displayName>S0M0AR</displayName>
          <description>stream x memory 0 address
          register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory 0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1AR</name>
          <displayName>S0M1AR</displayName>
          <description>stream x memory 1 address
          register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory 1 address (used in case of Double
              buffer mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <displayName>S0FCR</displayName>
          <description>stream x FIFO control register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000021</resetValue>
          <fields>
            <field>
              <name>FEIE</name>
              <description>FIFO error interrupt
              enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>FEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>FE interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>FE interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FS</name>
              <description>FIFO status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>FS</name><usage>read-write</usage><enumeratedValue><name>Quarter1</name><description>0 &lt; fifo_level &lt; 1/4</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter2</name><description>1/4 &lt;= fifo_level &lt; 1/2</description><value>1</value></enumeratedValue><enumeratedValue><name>Quarter3</name><description>1/2 &lt;= fifo_level &lt; 3/4</description><value>2</value></enumeratedValue><enumeratedValue><name>Quarter4</name><description>3/4 &lt;= fifo_level &lt; full</description><value>3</value></enumeratedValue><enumeratedValue><name>Empty</name><description>FIFO is empty</description><value>4</value></enumeratedValue><enumeratedValue><name>Full</name><description>FIFO is full</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMDIS</name>
              <description>Direct mode disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>DMDIS</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Direct mode is enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Direct mode is disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FTH</name>
              <description>FIFO threshold selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>FTH</name><usage>read-write</usage><enumeratedValue><name>Quarter</name><description>1/4 full FIFO</description><value>0</value></enumeratedValue><enumeratedValue><name>Half</name><description>1/2 full FIFO</description><value>1</value></enumeratedValue><enumeratedValue><name>ThreeQuarters</name><description>3/4 full FIFO</description><value>2</value></enumeratedValue><enumeratedValue><name>Full</name><description>Full FIFO</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
