probe-rs/probe-rs-debugger-test/svd_files/STM32H745ZITx.svd
            <field><name>ADD_SECT</name><description>Bank 1 CRC sector select bit</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CRC_BY_SECT</name><description>Bank 1 CRC sector mode select bit</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CRC_SECT</name><description>Bank 1 CRC sector number</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field>
            </fields></register>
        <register><name>CRCSADDR</name><description>FLASH CRC start address register for bank 1</description><addressOffset>0x50</addressOffset><resetValue>0</resetValue><fields><field><name>CRC_START_ADDR</name><description>CRC start address on bank 1</description><bitOffset>2</bitOffset><bitWidth>18</bitWidth></field>
            </fields></register>
        <register><name>CRCEADDR</name><description>FLASH CRC end address register for bank 1</description><addressOffset>0x54</addressOffset><resetValue>0</resetValue><fields><field><name>CRC_END_ADDR</name><description>CRC end address on bank 1</description><bitOffset>2</bitOffset><bitWidth>18</bitWidth></field>
            </fields></register>
        <register><name>FAR</name><description>FLASH ECC fail address for bank 1</description><addressOffset>0x5c</addressOffset><resetValue>0</resetValue><fields><field><name>FAIL_ECC_ADDR</name><description>Bank 1 ECC error address</description><bitOffset>0</bitOffset><bitWidth>15</bitWidth></field>
            </fields></register>
        </cluster><register><name>ACR</name><description>FLASH access control register</description><addressOffset>0</addressOffset><resetValue>55</resetValue><fields><field><name>WRHIGHFREQ</name><description>Flash signal delay</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>LATENCY</name><description>Read latency</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            </fields></register>
        <register><name>OPTKEYR</name><description>FLASH option key register</description><addressOffset>8</addressOffset><access>write-only</access><resetValue>0</resetValue><fields><field><name>OPTKEYR</name><description>FLASH option bytes control access unlock key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        <register><name>OPTCR</name><description>FLASH option control register</description><addressOffset>24</addressOffset><resetValue>1</resetValue><fields><field><name>SWAP_BANK</name><description>Bank swapping option configuration bit</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>OPTCHANGEERRIE</name><description>Option byte change error interrupt enable bit</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MER</name><description>mass erase request</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>OPTSTART</name><description>Option byte start change option configuration bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>OPTLOCK</name><description>FLASH</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>OPTSR_CUR</name><description>FLASH option status register</description><addressOffset>28</addressOffset><resetValue>0</resetValue><fields><field><name>SWAP_BANK_OPT</name><description>Bank swapping option status bit</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>OPTCHANGEERR</name><description>Option byte change error flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IO_HSLV</name><description>I</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>NRST_STBY_D2</name><description>D2 domain DStandby entry reset option status bit</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>NRST_STOP_D2</name><description>D2 domain DStop entry reset option status bit</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BOOT_CM7</name><description>Arm Cortex</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BOOT_CM4</name><description>Arm Cortex</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SECURITY</name><description>Security enable option status bit</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ST_RAM_SIZE</name><description>ST RAM size option status</description><bitOffset>19</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>IWDG_FZ_SDBY</name><description>IWDG Standby mode freeze option status bit</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IWDG_FZ_STOP</name><description>IWDG Stop mode freeze option status bit</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RDP</name><description>Readout protection level option status byte</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>RST_STDY_D1</name><description>D1 domain DStandby entry reset option status bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>NRST_STOP_D1</name><description>D1 domain DStop entry reset option status bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IWDG2_SW</name><description>IWDG2 control mode option status bit</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IWDG_SW</name><description>IWDG control mode option status bit</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BOR_LEV</name><description>Brownout level option status bit</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>OPT_BUSY</name><description>Option byte change ongoing flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>OPTSR_PRG</name><description>FLASH option status register</description><addressOffset>32</addressOffset><resetValue>0</resetValue><fields><field><name>SWAP_BANK_OPT</name><description>Bank swapping option configuration bit</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IO_HSLV</name><description>I</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>NRST_STBY_D2</name><description>D2 domain DStandby entry reset option configuration bit</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>NRST_STOP_D2</name><description>D2 domain DStop entry reset option configuration bit</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BOOT_CM7</name><description>Arm Cortex</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BOOT_CM4</name><description>Arm Cortex</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SECURITY</name><description>Security enable option configuration bit</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ST_RAM_SIZE</name><description>ST RAM size option configuration bits</description><bitOffset>19</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>IWDG_FZ_SDBY</name><description>IWDG Standby mode freeze option configuration bit</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IWDG_FZ_STOP</name><description>IWDG Stop mode freeze option configuration bit</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RDP</name><description>Readout protection level option configuration bits</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>NRST_STDY_D1</name><description>D1 domain DStandby entry reset option configuration bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>NRST_STOP_D1</name><description>D1 domain DStop entry reset option configuration bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IWDG2_SW</name><description>IWDG2 control mode option configuration bit</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IWDG_SW</name><description>IWDG control mode option configuration bit</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BOR_LEV</name><description>Brownout level option configuration bit</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>OPTCCR</name><description>FLASH option clear control register</description><addressOffset>36</addressOffset><resetValue>0</resetValue><fields><field><name>CLR_OPTCHANGEERR</name><description>OPTCHANGEERR reset bit</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>BOOT7_CURR</name><description>FLASH register boot address for Arm Cortex-M7 core</description><addressOffset>64</addressOffset><resetValue>0</resetValue><fields><field><name>BOOT_CM7_ADD1</name><description>Arm Cortex-M7 boot address 1</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>BOOT_CM7_ADD0</name><description>Arm Cortex-M7 boot address 0</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>BOOT7_PRGR</name><description>FLASH register boot address for Arm Cortex-M7 core</description><addressOffset>68</addressOffset><resetValue>0</resetValue><fields><field><name>BOOT_CM7_ADD1</name><description>Arm Cortex-M7 boot address 1 configuration</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>BOOT_CM7_ADD0</name><description>Arm Cortex-M7 boot address 0 configuration</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>BOOT4_CURR</name><description>FLASH register boot address for Arm Cortex-M4 core</description><addressOffset>72</addressOffset><resetValue>0</resetValue><fields><field><name>BOOT_CM4_ADD1</name><description>Arm Cortex-M4 boot address 1</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>BOOT_CM4_ADD0</name><description>Arm Cortex-M4 boot address 0</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>BOOT4_PRGR</name><description>FLASH register boot address for Arm Cortex-M4 core</description><addressOffset>76</addressOffset><resetValue>0</resetValue><fields><field><name>BOOT_CM4_ADD1</name><description>Arm Cortex-M4 boot address 1 configuration</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>BOOT_CM4_ADD0</name><description>Arm Cortex-M4 boot address 0 configuration</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>CRCDATAR</name><description>FLASH CRC data register</description><addressOffset>92</addressOffset><resetValue>0</resetValue><fields><field><name>CRC_DATA</name><description>CRC result</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        </registers></peripheral>
    <peripheral><name>RAMECC1</name><description>RAM ECC monitoring</description><groupName>RAMECC</groupName><baseAddress>1375768576</baseAddress><interrupt><name>RAMECC</name><description>ECC diagnostic global interrupt for all RAMECC controllers</description><value>145</value></interrupt>
    <registers><register><name>IER</name><description>RAMECC interrupt enable register</description><addressOffset>0</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>GECCDEBWIE</name><description>Global ECC double error on byte write interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GECCDEIE</name><description>Global ECC double error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GECCSEIE</name><description>Global ECC single error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GIE</name><description>Global interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1CR</name><description>RAMECC monitor 1 configuration register</description><addressOffset>32</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1SR</name><description>RAMECC monitor 1 status register</description><addressOffset>36</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1FAR</name><description>RAMECC monitor 1 failing address register</description><addressOffset>40</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FDRL</name><description>RAMECC monitor 1 failing data low register</description><addressOffset>44</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FDRH</name><description>RAMECC monitor 1 failing data high register</description><addressOffset>48</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FECR</name><description>RAMECC monitor 1 failing error code register</description><addressOffset>52</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2CR</name><description>RAMECC monitor 2 configuration register</description><addressOffset>64</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M2SR</name><description>RAMECC monitor 2 status register</description><addressOffset>68</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M2FAR</name><description>RAMECC monitor 2 failing address register</description><addressOffset>72</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FDRL</name><description>RAMECC monitor 2 failing data low register</description><addressOffset>76</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FDRH</name><description>RAMECC monitor 2 failing data high register</description><addressOffset>80</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FECR</name><description>RAMECC monitor 2 failing error code register</description><addressOffset>84</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M3CR</name><description>RAMECC monitor 3 configuration register</description><addressOffset>96</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M3SR</name><description>RAMECC monitor 3 status register</description><addressOffset>100</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M3FAR</name><description>RAMECC monitor 3 failing address register</description><addressOffset>104</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M3FDRL</name><description>RAMECC monitor 3 failing data low register</description><addressOffset>108</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M3FDRH</name><description>RAMECC monitor 3 failing data high register</description><addressOffset>112</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M3FECR</name><description>RAMECC monitor 3 failing error code register</description><addressOffset>116</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M4CR</name><description>RAMECC monitor 4 configuration register</description><addressOffset>128</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
